app/controllers/menus_controller.rb

INSERT INTO "menus" ("created_at", "menu", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 06 Jun 2014 13:54:12 UTC +00:00], ["menu", "papi"], ["updated_at", Fri, 06 Jun 2014 13:54:12 UTC +00:00]]
---
  def create
    @menu = Menu.new(menu_params)

    if @menu.save

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @menu = Menu.find(params[:id])

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @menu = Menu.find(params[:id])

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "menus" SET "menu" = ?, "updated_at" = ? WHERE "menus"."id" = 1  [["menu", "chicken . . . . . . . . . . . . . . . . . . . . . . .      $5\r\nbeef . . . . . . . . . . . . . . . . . . . . . . . . . .      $6"], ["updated_at", Sun, 08 Jun 2014 23:30:37 UTC +00:00]]
---
  def update
    @menu = Menu.find(params[:id])

    if @menu.update(menu_params)