app/controllers/pages_controller.rb

def create
  @page = Page.new(page_params)

  if @page.save
---
INSERT INTO "pages" ("created_at", "email", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 16 Jun 2014 13:06:44 UTC +00:00], ["email", "Leo@gmail.com"], ["name", "Chef Leo "], ["title", "New Item "], ["updated_at", Mon, 16 Jun 2014 13:06:44 UTC +00:00]]