app/controllers/sessions_controller.rb

  def create
    user = User.where(name: params[:name]).first
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'daddy10' ORDER BY "users"."id" ASC LIMIT 1