app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest") VALUES (?, ?, ?)  [["email", "daddy"], ["name", "daddy10"], ["password_digest", "$2a$10$BRjY25Ho.D/uV1xaO9Q3N.05mYAyvTcLZJboJLmcPBo4MGlHKqacK"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "users" SET "name" = ?, "password_digest" = ? WHERE "users"."id" = 14  [["name", "daddyme5"], ["password_digest", "$2a$10$SPjx6cIC4iC8djNVclUKWOEPmTRebUC9ezgg2AOLXAWkHMBHlopuC"]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)